In [5]:
import pandas as pd
import numpy as np

data=({'Name':['A','B','C','D','E','F','G','A','A','J'],
      'Age':[21,22,23,24,25,np.nan,27,28,29,30],
      'Salary':[10000,np.nan,30000,40000,500000,60000,70000,80000,90000,100000],
      'Dept':['IT','fIN','IT','IT','account','govern','def',np.nan,'IT',np.nan]})
df=pd.DataFrame(data)
df.head(10)

  Name   Age    Salary     Dept
0    A  21.0   10000.0       IT
1    B  22.0       NaN      fIN
2    C  23.0   30000.0       IT
3    D  24.0   40000.0       IT
4    E  25.0  500000.0  account
5    F   NaN   60000.0   govern
6    G  27.0   70000.0      def
7    A  28.0   80000.0      NaN
8    A  29.0   90000.0       IT
9    J  30.0  100000.0      NaN

In [6]:
df.isnull().sum()

Name      0
Age       1
Salary    1
Dept      2
dtype: int64

In [7]:
df['Age'].fillna(df['Age'].mean(),inplace =True)
df.isnull().sum()

Name      0
Age       0
Salary    1
Dept      2
dtype: int64

In [8]:
df.duplicated().sum()

0

In [9]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)
df.isnull().sum()

Name      0
Age       0
Salary    0
Dept      2
dtype: int64

In [10]:
df['Dept'].value_counts()

Dept
IT         4
fIN        1
account    1
govern     1
def        1
Name: count, dtype: int64

In [11]:
df['Dept'].fillna('IT',inplace=True)
df.isnull().sum()

Name      0
Age       0
Salary    0
Dept      0
dtype: int64

In [12]:
df1= df.copy()
df1

  Name        Age         Salary     Dept
0    A  21.000000   10000.000000       IT
1    B  22.000000  108888.888889      fIN
2    C  23.000000   30000.000000       IT
3    D  24.000000   40000.000000       IT
4    E  25.000000  500000.000000  account
5    F  25.444444   60000.000000   govern
6    G  27.000000   70000.000000      def
7    A  28.000000   80000.000000       IT
8    A  29.000000   90000.000000       IT
9    J  30.000000  100000.000000       IT

In [13]:
df.duplicated().sum()

0

In [15]:
df.drop('Salary',axis=1,inplace=True)

In [ ]:
df1.copy()

In [ ]:
df.duplicated().sum()

In [ ]:
import pandas as pd
import numpy as np

data=({'Name':['A','B','C','D','E','F','G','A','A','J'],
      'Age':[21,22,23,24,25,np.nan,27,28,29,30],
      'Salary':[10000,np.nan,30000,40000,500000,60000,70000,80000,90000,100000],
      'Dept':['IT','fIN','IT','IT','account','govern','def',np.nan,'IT',np.nan]})
df=pd.DataFrame(data)
df.head(10)

In [ ]:
df.isnull().sum()

In [ ]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df.isnull().sum()

In [ ]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)
df.isnull().sum()

In [ ]:
df['Age'].value_counts()

In [ ]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df.isnull().sum()

In [ ]:
#df.drop('Age',axis=1,inplace=True)
#df.head()

In [ ]:
df.duplicated().sum()

In [ ]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

In [ ]:
df1=df.copy()
df1

In [ ]:
import pandas as pd
import numpy as np

data=({'Name':['A','B','C','D','E','F','G','A','A','J'],
      'Age':[21,22,23,24,25,np.nan,27,28,29,30],
      'Salary':[10000,np.nan,30000,40000,500000,60000,70000,80000,90000,100000],
      'Dept':['IT','fIN','IT','IT','account','govern','def',np.nan,'IT',np.nan]})
df=pd.DataFrame(data)
df.head(10)

In [ ]:
df.isnull().sum()

In [ ]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df.isnull().sum()

In [ ]:
from sklearn.impute import SimpleImputer
sim_num=SimpleImputer(missing_values=np.nan,strategy='mean')
sim_cat=SimpleImputer(missing_values=np.nan,strategy='most_frequent')
age_imp=sim_num.fit_transform(df[['Age']])
age_imp

In [ ]:
dept_imp=sim_cat.fit_transform(df[['Dept']])
dept_imp

In [ ]:
df.isnull().sum()